-- phpMyAdmin SQL Dump
-- version 4.7.0
-- https://www.phpmyadmin.net/
--
-- 主機: 127.0.0.1
-- 產生時間： 2017-09-22 04:48:34
-- 伺服器版本: 10.1.25-MariaDB
-- PHP 版本： 5.6.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `book_list`
--

-- --------------------------------------------------------

--
-- 資料表結構 `book`
--

CREATE TABLE `book` (
  `id` int(11) UNSIGNED NOT NULL,
  `ISBN` varchar(20) NOT NULL,
  `press` varchar(20) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `address` varchar(50) NOT NULL,
  `bName` varchar(20) NOT NULL,
  `author` varchar(20) NOT NULL,
  `prize` int(11) NOT NULL,
  `day` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `book`
--

INSERT INTO `book` (`id`, `ISBN`, `press`, `phone`, `address`, `bName`, `author`, `prize`, `day`) VALUES
(1, '957-442-217-1', '旗標', '04-27050888', '台中市西屯區西屯路二段256巷6號3樓之6', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(2, '957-442-217-2', '旗標', '04-27050888', '台中市西屯區西屯路二段256巷6號3樓之6', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(3, '957-442-217-3', '旗標', '04-27050888', '台中市西屯區西屯路二段256巷6號3樓之6', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(4, '957-442-217-4', '旗標', '04-27050888', '台中市西屯區西屯路二段256巷6號3樓之6', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(5, '957-442-217-5', '旗標', '04-27050888', '台中市西屯區西屯路二段256巷6號3樓之6', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(6, '957-442-217-6', '旗標', '04-27050888', '台中市西屯區西屯路二段256巷6號3樓之6', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(7, '957-442-217-7', 'ABC', '', '', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(8, '957-442-217-8', '旗標', '04-27050888', '台中市西屯區西屯路二段256巷6號3樓之6', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(9, '957-442-217-9', '旗標', '04-27050888', '台中市西屯區西屯路二段256巷6號3樓之6', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(10, '957-442-217-10', '旗標', '04-27050888', '台中市西屯區西屯路二段256巷6號3樓之6', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(11, '957-442-217-11', '翰林', '04-12345678', '台中市西屯區西屯路二段123巷5號10樓', 'MYSQL教學', '汪曉霞', 60000, '2004-06-10'),
(12, '957-442-217-12', '翰林', '04-12345678', '台中市西屯區西屯路二段123巷5號10樓', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(13, '957-442-217-13', '翰林', '04-12345678', '台中市西屯區西屯路二段123巷5號10樓', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(14, '957-442-217-14', '翰林', '04-12345678', '台中市西屯區西屯路二段123巷5號10樓', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(16, '957-442-217-16', '翰林', '04-12345678', '台中市西屯區西屯路二段123巷5號10樓', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(17, '957-442-217-17', '翰林', '04-12345678', '台中市西屯區西屯路二段123巷5號10樓', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(18, '957-442-217-18', 'QQQ', '', '', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(19, '957-442-217-19', 'DDD', '', '', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(20, '957-442-217-20', 'BBB', '', '', 'MYSQL教學', '汪曉霞', 600, '2004-06-10');

--
-- 已匯出資料表的索引
--

--
-- 資料表索引 `book`
--
ALTER TABLE `book`
  ADD PRIMARY KEY (`id`);

--
-- 在匯出的資料表使用 AUTO_INCREMENT
--

--
-- 使用資料表 AUTO_INCREMENT `book`
--
ALTER TABLE `book`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=76;COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
