-- phpMyAdmin SQL Dump
-- version 4.7.0
-- https://www.phpmyadmin.net/
--
-- 主機: 127.0.0.1
-- 產生時間： 2017-09-21 05:33:36
-- 伺服器版本: 10.1.25-MariaDB
-- PHP 版本： 5.6.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `book_list`
--

-- --------------------------------------------------------

--
-- 資料表結構 `book`
--

CREATE TABLE `book` (
  `id` int(11) UNSIGNED NOT NULL,
  `ISBN` varchar(20) NOT NULL,
  `press` varchar(20) NOT NULL,
  `bName` varchar(20) NOT NULL,
  `author` varchar(20) NOT NULL,
  `prize` int(11) NOT NULL,
  `day` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `book`
--

INSERT INTO `book` (`id`, `ISBN`, `press`, `bName`, `author`, `prize`, `day`) VALUES
(1, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(2, '957-442-217-2', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(3, '957-442-217-3', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(4, '957-442-217-4', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(5, '957-442-217-5', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(6, '957-442-217-6', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(7, '957-442-217-7', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(8, '957-442-217-8', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(9, '957-442-217-9', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(10, '957-442-217-10', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(11, '957-442-217-11', '旗標', 'MYSQL教學', '汪曉霞', 60000, '2004-06-10'),
(12, '957-442-217-12', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(13, '957-442-217-13', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(14, '957-442-217-14', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(16, '957-442-217-16', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(17, '957-442-217-17', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(18, '957-442-217-18', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(19, '957-442-217-19', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(20, '957-442-217-20', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(21, '957-442-217-21', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(22, '957-442-217-22', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(23, '957-442-217-23', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(24, '957-442-217-24', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(25, '957-442-217-25', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(26, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(27, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(28, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(29, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(30, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(31, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(32, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(33, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(34, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(35, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(36, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(37, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(38, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(39, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(40, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(41, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(42, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(43, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(44, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(45, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(46, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(47, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(48, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(49, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(50, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(51, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(52, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(53, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(54, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(55, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(56, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(57, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(58, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(59, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(60, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(61, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(62, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(63, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(64, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(65, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(66, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(67, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(68, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(69, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(70, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(71, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(72, '957-442-217-1', '旗標', 'PHP函式庫參考手冊', '施威銘', 5000, '2004-06-13'),
(73, '957-442-217-6', '旗標', 'MYSQL教學', '汪曉霞', 600, '2004-06-10'),
(74, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01'),
(75, '957-442-217-5', '旗標', 'MYSQL教學', '王大名', 500, '2017-09-01');

--
-- 已匯出資料表的索引
--

--
-- 資料表索引 `book`
--
ALTER TABLE `book`
  ADD PRIMARY KEY (`id`);

--
-- 在匯出的資料表使用 AUTO_INCREMENT
--

--
-- 使用資料表 AUTO_INCREMENT `book`
--
ALTER TABLE `book`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=76;COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
